[
    {
    "name": "Lieutenant",
    "description": "This position is given to those Sergeants who may become eligible for a promotion after 3 weeks of training and experience in KSI.<br /><br />Successful fulfillment of the Sergeant rank for at least 2 weeks time.<br /><br />Helping their Captains with squad activities and the squad lists. A lieutenant should know and understand how to run background checks on the new members. They must being fully trained in recruiting techniques and know the Code of Conduct an rank structure.<br /><br />They have to be active on ksiglobal.com and the KSI Forums. They are responsible for solving minor problems and recruiting new members.<br /><br />Reports to Captain, Major and General.<br /><br />They should be role models for Sergeants, Corporals, and Privates."
    },
    {
        "name": "Sergeant",
        "description": "This position is given to those Privates or Corporals who have acquired a KSI tag.<br /><br />Acquiring a KSI Gamer tag, being in KSI for at least 2 weeks, and having permission from a Captain to get it.<br /><br />Uphold the Code of Conduct; stay active as a gamer and be registered on ksiglobal.com and KSI Forums. They should also know the rank Structure up through Director.<br /><br />Reports to Lieutenants, and any other higher rank.<br /><br />The 2 weeks wait to get the KSI gamer tag is to ensure the member wants to be part of the community; they have to understand that they will represent KSI from that moment on."
    },
    {
        "name": "Corporal",
        "description": "This position is given to those Privates who have recruited 10 or more members into their squad and can't get a KSI tag yet.<br /><br />Recruiting 10 or more members, explaining them the KSI Code of Conduct, registered at ksiglobal.com and the KSI Forums.<br /><br />Participating in Squad Activities, being active on the KSI Forums and fully understanding the Code of Conduct and the Rank Structure up through Co-Founder, and being a role model to new recruits.<br /><br />Reports to Sergeants or Lieutenants, or any other higher rank.<br /><br />Corporal are encouraged but not required to change their gamer tag within 60 days. They must have permission of a Captain to get it, and staying in KSI for at least 2 weeks. Any problems they might have should report to the Lieutenants."
    },
    {
        "name": "Private",
        "description": "This is the first position acquired with your enrollment in the community.<br /><br />Joining a legit KSI squad, agrees to change motto and bio.<br /><br />Getting and remaining in uniform, according to the indications of the recruiter, agreeing to respect the Code of Conduct and The Xbox Live Disclaimer, starting to learn the Rank Structure up through General rank, sign up at ksiglobal.com and the KSI Forums, and meet other KSI members by attending squad activities. <br /><br />Reports to Sergeants, or any other higher rank.<br /><br /> Privates are encouraged but not required to change their gamer tag within  60 days. They must have permission of a Captain to get it, and staying in  KSI for at least 2 weeks. Any problems they might have should report to the Lieutenants."
    },
    {
        "name": "KSI Member",
        "description": "This position is for any KSI member who opts out of being within KSI Leadership Structure but, must follow KSI Code of Conduct, KSI Leadership Structure, & KSI Chain of Command. They must also agree to changing motto and bio."
    }
]
